# WaveDistribution Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wave..::..WaveDistribution Property
Wave Class See Also
---
The property labeled "Distribution" from the "Wave" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WaveDistribution { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WaveDistribution As String
	Get
```

Visual C++
---
```text
public:
static property String^ WaveDistribution {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaveDistributionType".
# See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace